"""
正则表达式: 一种由特定语法规则组成的文本模式,用来描述.匹配字符串中符合规定的字符序列,就相当于一种模式匹配的工具
          允许用户通过简洁的语法进行复杂的文本搜素,匹配和替换的工作
          1[3-9]\\d{9} [3-9]: 1到9的数   \\d: 任意数字   {9}: 9次


import re
          re.match: 从字符串的开头进行匹配,如果匹配成功返回匹配对象,否则返回None
          re.search: 从字符串的任意位置进行匹配,如果匹配成功返回匹配对象,否则返回None
          re.findall: 返回所有匹配的子串,是一个列表
"""
import  re
s1 = "18393491490是我的手机号,我qq是3484892642"
s2 = "我的手机号是17678776590,我qq是7654743554"
#
# result =re.match(r"1[3-9]\d{9}", s1)
# print(result.group())
# print(result.span())


# result =re.search(r"1[3-9]\d{9}", s2)
# print(result.group())
# print(result.span())

result =re.findall(r"1[3-9]\d{9}", s2)
print(result)

"""
语法:
.:匹配任意一个字符
\d:匹配0-9的数字
\D:匹配非数字
\w:匹配字母,数字,下划线
\W:匹配非字母,数字,下划线
[aeiou]:匹配任意一个元音字母
[^aeiou]: 求反
[0-5]: 匹配0-5的数字
*:出现任意次
+:至少出现一次
?:至多出现一次
{m}:出现m次
{m,n}:出现m到n次
| : 匹配左右任意一个表达式
():分组
^:字符串的开始
$:字符串的结束
"""



